import numpy as np

config = {
    "eta": 0.996,  # 結合損
    "alpha": 11.51,  # 伝搬損失係数
    "K": np.array([0.10301904, 0.0404572, 0.03604664, 0.04701944, 0.06127546, 0.14894851, 0.67077241]),  # 結合率
    "L": np.array(
        [
        6.2e-05,
        6.2e-05,
        7.749999999999999e-05,
        7.749999999999999e-05,
        7.749999999999999e-05,
        7.749999999999999e-05
    ]
    ),  # リング周長
    "n_eff": 2.2,  # 実行屈折率
    "n_g": 4.2,  # 群屈折率
    "center_wavelength": 1550e-9,
    "lambda_limit": np.arange(1510e-9, 1555e-9, 1e-12)
}
