import numpy as np

config = {
    "eta": 1,  # 結合損
    "alpha": 52.96,  # 伝搬損失係数
    "K": np.array(
        [0.3696506758824061, 0.051634910388079325, 0.05298141309000143, 0.03977264080213472, 0.2657667002829907]
    ),  # 結合率
    "L": np.array(
        [5.495454545454545e-05, 5.495454545454545e-05, 8.243181818181816e-05, 5.495454545454545e-05]
    ),  # リング周長
    "n_eff": 3.3938,  # 実行屈折率
    "n_g": 4.2,  # 群屈折率
    "center_wavelength": 1550e-9,
    "lambda_limit": np.arange(1520e-9, 1560e-9, 1e-12),
}
