import numpy as np

config = {
    "eta": 0.996,  # 結合損
    "alpha": 52.96,  # 伝搬損失係数
    "K": np.array([
        0.3628673914859795,
        0.044854634504787036,
        0.05641542769980563,
        0.0524982820565632,
        0.04421949641235924,
        0.11942171785238494,
        0.586620021922363
    ]),  # 結合率
    "L": np.array(
        [
        6.2e-05,
        7.75e-05,
        7.75e-05,
        6.2e-05,
        7.75e-05,
        7.75e-05
    ]
    ),  # リング周長
    "n_eff": 2.2,  # 実行屈折率
    "n_g": 4.2,  # 群屈折率
    "center_wavelength": 1550e-9,
    "lambda_limit": np.arange(1510e-9, 1555e-9, 1e-12)
}
